src/main/test/supply-chain/1-Grouping/0-Apply Tax/0-02_01_SUBCLASS-Grouping/1-TC02_01.02_Grouping_On_header_level/4-TC02_01.02_Grouping_On_header_level-5-SERVICE/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
     <arg0>
            <DocumentId>
                    <SystemSourceId>ICI001</SystemSourceId>
                </DocumentId>
                <AlternateDocumentId>
                    <CustomField1>42713616</CustomField1>
                    <CustomField2>4992-G-INV-0</CustomField2>
                    <CustomField3>1</CustomField3>
                    <CustomField4>319-DT-130918885710/1</CustomField4>
                    <CustomField5>ROOT:Y/PA035:N/PA059:Y/PA060:N/PA061:N/RES_CnorReg</CustomField5>
                </AlternateDocumentId>
                <InvoiceLanguage>
                    <LanguageCode>en</LanguageCode>
                    <LanguageCountryCode>GB</LanguageCountryCode>
                </InvoiceLanguage>
                <CommunicationLanguage>
                    <LanguageCode>en</LanguageCode>
                    <LanguageCountryCode>GB</LanguageCountryCode>
                </CommunicationLanguage>
                <CalculationDecimalPlaces>5</CalculationDecimalPlaces>
                <PreviousInvoiceTaxCountry>CN</PreviousInvoiceTaxCountry>
                <TaxDecisionSet>
                    <SellerTaxIndicator>
                        <TaxIndicatorAbbreviation/>
                        <TaxIndicatorName/>
                        <TaxIndicatorComment/>
                    </SellerTaxIndicator>
                    <BuyerTaxIndicator>
                        <TaxIndicatorAbbreviation/>
                        <TaxIndicatorName/>
                        <TaxIndicatorComment/>
                    </BuyerTaxIndicator>
                    <CommercialIndicator/>
                    <SellerTaxRegCountry/>
                    <SellerTaxRegState/>
                    <BuyerTaxRegCountry/>
                    <BuyerTaxRegState/>
                    <InvoiceCurrency>
                        <CurrencyCode>CNY</CurrencyCode>
                    </InvoiceCurrency>
                    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
                    <TaxInvoiceLine>
                        <LineNumber>73.1</LineNumber>
                        <ItemNo>90227377</ItemNo>
                        <ItemType>ART</ItemType>
                        <UNSPSC>90000000</UNSPSC>
                        <NetAmount>12411.48</NetAmount>
                        <SellerCountry/>
                        <SellerState/>
                        <BuyerCountry/>
                        <BuyerState/>
                    </TaxInvoiceLine>
                    <TaxInvoiceLine>
                        <LineNumber>73.1</LineNumber>
                        <ItemNo>90227377</ItemNo>
                        <ItemType>ART</ItemType>
                        <UNSPSC>90000000</UNSPSC>
                        <NetAmount>12411.48</NetAmount>
                        <SellerCountry/>
                        <SellerState/>
                        <BuyerCountry/>
                        <BuyerState/>
                    </TaxInvoiceLine>                                                                                                                                                                                                                              
                </TaxDecisionSet>
                <TaxDate>
                    <TaxAlgorithmDate>2015-05-10</TaxAlgorithmDate>
                    <TaxCalculationDate/>
                </TaxDate>
                <TaxModuleBehaviour>
                    <SkipCalculation>Y</SkipCalculation>
                    <SkipDecision>N</SkipDecision>
                </TaxModuleBehaviour>
                <VariableTaxSteeringInput>
                    <ConsignorCountry>CN</ConsignorCountry>
                    <ConsignorBusinessUnitCode>12345</ConsignorBusinessUnitCode>
                    <ConsignorBusinessUnitType>DT</ConsignorBusinessUnitType>
                    <ConsigneeCountry>CN</ConsigneeCountry>
                    <ConsigneeBusinessUnitCode>12345</ConsigneeBusinessUnitCode>
                    <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
                     <ServiceRenderedCountry>CN</ServiceRenderedCountry>
                    <ResalePurpose>Y</ResalePurpose>
                    <IsOutBonded>N</IsOutBonded>
                    <IsInBonded>N</IsInBonded>
                    <TaxPreAlgorithmOutput>
                        <IsExport>N</IsExport>
                        <IsImport>N</IsImport>
                        <IsExported>N</IsExported>
                        <IsImported>N</IsImported>
                    </TaxPreAlgorithmOutput>
                </VariableTaxSteeringInput>
                <BuyerParty>
                    <Party>
                        <BusinessUnitCode>4960</BusinessUnitCode>
                        <BusinessUnitType>COM</BusinessUnitType>
                        <BusinessUnitName>IKEA (CHINA) INVESTMENT CO., LTD</BusinessUnitName>
                        <PartyAddress>
                            <AddressType>MAIN</AddressType>
                            <City>SHANGHAI, XUHUI DIST.</City>
                            <Street>3RD BLDG, NO. 190, LONTIAN RD.</Street>
                            <ZipCode>201204</ZipCode>
                            <CountryCode>CN</CountryCode>
                        </PartyAddress>
                    </Party>
                </BuyerParty>
                <SellerParty>
                    <Party>
                        <BusinessUnitCode>4992</BusinessUnitCode>
                        <BusinessUnitType>COM</BusinessUnitType>
                        <BusinessUnitName>IKEA DISTRIBUTION SERVICES (SHANGHAI) CO. LTD</BusinessUnitName>
                        <PartyAddress>
                            <AddressType>MAIN</AddressType>
                            <City>SHANGHAI</City>
                            <Street>399 Gangwen Road, Fengxian District</Street>
                            <ZipCode>201413</ZipCode>
                            <CountryCode>CN</CountryCode>
                        </PartyAddress>
                    </Party>
                </SellerParty>
                <TermOfDelivery>DDU</TermOfDelivery>
                <Error>
		    <ErrorCode/>
		    <ErrorType/>
		    <ErrorText/>
		  </Error>
		  </arg0>
         </ws:applyTax>
   </soap:Body>
</soap:Envelope>